In [1]:
## Importing pandas for data analysis

import pandas as pd

In [2]:
## Loading csv into a pandas dataframe

df = pd.read_csv('profiles.csv')

In [3]:
## Getting the OkCupid variables in a list format
## We are going to have to go over each column
## to see if it needs cleaning before we analyze
## and make assumptions.

## It is important that we can recognize, filter, and
## adjust data that are irrelevant, or incorrect to make
## sure our results are as accurate as possible

list(df)

['age',
 'body_type',
 'diet',
 'drinks',
 'drugs',
 'education',
 'essay0',
 'essay1',
 'essay2',
 'essay3',
 'essay4',
 'essay5',
 'essay6',
 'essay7',
 'essay8',
 'essay9',
 'ethnicity',
 'height',
 'income',
 'job',
 'last_online',
 'location',
 'offspring',
 'orientation',
 'pets',
 'religion',
 'sex',
 'sign',
 'smokes',
 'speaks',
 'status']

In [4]:
## For the age variable, we see that is data for all 59946
## Everything seems normal here. 

age = df[['age']]
age.describe()

                age
count  59946.000000
mean      32.340290
std        9.452779
min       18.000000
25%       26.000000
50%       30.000000
75%       37.000000
max      110.000000

In [5]:
## For the body_type variable, we combine
## it with sex in order to count
## Everything seems normal here. 

body_type = df[['body_type', 'sex']]
body_type_grouped = body_type.groupby('body_type')
body_type_grouped = body_type_grouped.count().reset_index()
body_type_grouped.rename(index=str, columns={"sex":"count"})

         body_type  count
0   a little extra   2629
1         athletic  11819
2          average  14652
3            curvy   3924
4              fit  12711
5     full figured   1009
6           jacked    421
7       overweight    444
8   rather not say    198
9           skinny   1777
10            thin   4711
11         used up    355

In [6]:
## Following the same explanations as above,
## everything seems normal here.

diet = df[['diet', 'sex']]
diet_grouped = diet.groupby('diet')
diet_grouped = diet_grouped.count()
diet_grouped = diet_grouped.reset_index()
diet_grouped.rename(index=str, columns={"sex":"count"})

                   diet  count
0              anything   6183
1                 halal     11
2                kosher     11
3       mostly anything  16585
4          mostly halal     48
5         mostly kosher     86
6          mostly other   1007
7          mostly vegan    338
8     mostly vegetarian   3444
9                 other    331
10    strictly anything   5113
11       strictly halal     18
12      strictly kosher     18
13       strictly other    452
14       strictly vegan    228
15  strictly vegetarian    875
16                vegan    136
17           vegetarian    667

In [7]:
## After diet, drinks and drugs seem normal as well.
## However, let's take a look at education.

## An interesting category in here is 'space camp'
## Through quick research, 'space camp' does exist.
## However, I don't think all of the responses are honest.
## I'm going to keep this in mind when comparing it
## with other responses.

education = df[['education', 'sex']]
education_grouped = education.groupby('education')
education_grouped = education_grouped.count().reset_index()
education_grouped.rename(index=str, columns={"sex":"count"})

                            education  count
0                  college/university    801
1   dropped out of college/university    995
2          dropped out of high school    102
3           dropped out of law school     18
4      dropped out of masters program    140
5           dropped out of med school     12
6         dropped out of ph.d program    127
7           dropped out of space camp    523
8     dropped out of two-year college    191
9   graduated from college/university  23959
10         graduated from high school   1428
11          graduated from law school   1122
12     graduated from masters program   8961
13          graduated from med school    446
14        graduated from ph.d program   1272
15          graduated from space camp    657
16    graduated from two-year college   1531
17                        high school     96
18                         law school     19
19                    masters program    136
20                         med school     11
21                       ph.d program     26
22                         space camp     58
23                   two-year college    222
24      working on college/university   5712
25             working on high school     87
26              working on law school    269
27         working on masters program   1683
28              working on med school    212
29            working on ph.d program    983
30              working on space camp    445
31        working on two-year college   1074

In [8]:
## Essays 0-9 are fill in the blank prompts.
## The titles are:
##     0: Self Summary, 1: What I'm doing with my life
##     2: I’m really good at
##     3: The first thing people usually notice about me
##     4: Favorite books, movies, show music, and food
##     5: The six things I could never do without
##     6: I spend a lot of time thinking about
##     7: On a typical Friday night I am
##     8: The most private thing I am willing to admit
##     9: You should message me if...

## Let's take a quick look at a few responses from User Index #0
df.loc[0,['age', 'body_type', 'diet', 'drinks', 'drugs', 'education',
 'ethnicity', 'height', 'income', 'job', 'last_online', 'location',
 'offspring', 'orientation', 'pets', 'religion', 'sex', 'sign',
 'smokes', 'speaks', 'status']]

age                                                      22
body_type                                    a little extra
diet                                      strictly anything
drinks                                             socially
drugs                                                 never
education                     working on college/university
ethnicity                                      asian, white
height                                                   75
income                                                   -1
job                                          transportation
last_online                                2012-06-28-20-30
location                    south san francisco, california
offspring      doesn&rsquo;t have kids, but might want them
orientation                                        straight
pets                              likes dogs and likes cats
religion              agnosticism and very serious about it
sex                                                       m
sign                                                 gemini
smokes                                            sometimes
speaks                                              english
status                                               single
Name: 0, dtype: object

In [9]:
## 0: Self Summary

df[['essay0']].iloc[0,0]

"about me:<br />\n<br />\ni would love to think that i was some some kind of intellectual:\neither the dumbest smart guy, or the smartest dumb guy. can't say i\ncan tell the difference. i love to talk about ideas and concepts. i\nforge odd metaphors instead of reciting cliches. like the\nsimularities between a friend of mine's house and an underwater\nsalt mine. my favorite word is salt by the way (weird choice i\nknow). to me most things in life are better as metaphors. i seek to\nmake myself a little better everyday, in some productively lazy\nway. got tired of tying my shoes. considered hiring a five year\nold, but would probably have to tie both of our shoes... decided to\nonly wear leather shoes dress shoes.<br />\n<br />\nabout you:<br />\n<br />\nyou love to have really serious, really deep conversations about\nreally silly stuff. you have to be willing to snap me out of a\nlight hearted rant with a kiss. you don't have to be funny, but you\nhave to be able to make me laugh. you should be able to bend spoons\nwith your mind, and telepathically make me smile while i am still\nat work. you should love life, and be cool with just letting the\nwind blow. extra points for reading all this and guessing my\nfavorite video game (no hints given yet). and lastly you have a\ngood attention span."

In [10]:
## 1: What I'm doing with my life

df[['essay1']].iloc[0,0]

'currently working as an international agent for a freight\nforwarding company. import, export, domestic you know the\nworks.<br />\nonline classes and trying to better myself in my free time. perhaps\na hours worth of a good book or a video game on a lazy sunday.'

In [11]:
## 2: I’m really good at

df[['essay2']].iloc[0,0]

'making people laugh.<br />\nranting about a good salting.<br />\nfinding simplicity in complexity, and complexity in simplicity.'

In [12]:
## 3: The first thing people usually notice about me

df[['essay3']].iloc[0,0]

'the way i look. i am a six foot half asian, half caucasian mutt. it\nmakes it tough not to notice me, and for me to blend in.'

In [13]:
## 4: Favorite books, movies, show music, and food

df[['essay4']].iloc[0,0]

"books:<br />\nabsurdistan, the republic, of mice and men (only book that made me\nwant to cry), catcher in the rye, the prince.<br />\n<br />\nmovies:<br />\ngladiator, operation valkyrie, the producers, down periscope.<br />\n<br />\nshows:<br />\nthe borgia, arrested development, game of thrones, monty\npython<br />\n<br />\nmusic:<br />\naesop rock, hail mary mallon, george thorogood and the delaware\ndestroyers, felt<br />\n<br />\nfood:<br />\ni'm down for anything."

In [14]:
## 5: The six things I could never do without

df[['essay5']].iloc[0,0]

'food.<br />\nwater.<br />\ncell phone.<br />\nshelter.'

In [15]:
## 6: I spend a lot of time thinking about

df[['essay6']].iloc[0,0]

'duality and humorous things'

In [16]:
## 7: On a typical Friday night I am

df[['essay7']].iloc[0,0]

'trying to find someone to hang out with. i am down for anything\nexcept a club.'

In [17]:
## 8: The most private thing I am willing to admit

df[['essay8']].iloc[0,0]

'i am new to california and looking for someone to wisper my secrets\nto.'

In [18]:
## 9: You should message me if...

df[['essay9']].iloc[0,0]

'you want to be swept off your feet!<br />\nyou are tired of the norm.<br />\nyou want to catch a coffee or a bite.<br />\nor if you want to talk philosophy.'

In [19]:
## Now, let's take a look at ethnicity.
## Generally, I would consider anywhere from
## 1-3 ethnicities as okay for a person to
## label themselves. However, when a person
## uses more than 3 ethnicities, I would
## assume that they are not taking the questions
## seriously. Similar users selecting 'space camp',
## I'm going to take note of this as well.

ethnicity = df[['ethnicity', 'sex']]
ethnicity_grouped = ethnicity.groupby('ethnicity')
ethnicity_grouped = ethnicity_grouped.count().reset_index()
ethnicity_grouped.rename(index=str, columns={"sex":"count"})

                                             ethnicity  count
0                                                asian   6134
1                                         asian, black     59
2                       asian, black, hispanic / latin      2
3                asian, black, hispanic / latin, other      2
4                asian, black, hispanic / latin, white      2
5         asian, black, hispanic / latin, white, other      1
6                                 asian, black, indian      1
7        asian, black, indian, hispanic / latin, other      1
8                        asian, black, native american      9
9      asian, black, native american, hispanic / latin      2
10   asian, black, native american, hispanic / lati...      2
11               asian, black, native american, indian      1
12   asian, black, native american, indian, hispani...      1
13   asian, black, native american, indian, pacific...      1
14   asian, black, native american, indian, pacific...      1
15                asian, black, native american, other      2
16     asian, black, native american, pacific islander      2
17   asian, black, native american, pacific islande...      1
18   asian, black, native american, pacific islande...      3
19   asian, black, native american, pacific islande...      1
20                asian, black, native american, white      8
21         asian, black, native american, white, other      2
22                                 asian, black, other      9
23                      asian, black, pacific islander      6
24    asian, black, pacific islander, hispanic / latin      4
25   asian, black, pacific islander, hispanic / lat...      1
26               asian, black, pacific islander, other      1
27               asian, black, pacific islander, white      2
28        asian, black, pacific islander, white, other      1
29                                 asian, black, white     15
..                                                 ...    ...
187                              middle eastern, white    300
188                       middle eastern, white, other     40
189                                    native american     67
190                  native american, hispanic / latin     73
191           native american, hispanic / latin, other     13
192           native american, hispanic / latin, white     87
193    native american, hispanic / latin, white, other     33
194                            native american, indian      2
195  native american, indian, pacific islander, his...      1
196                     native american, indian, white      1
197                             native american, other     16
198                  native american, pacific islander      2
199  native american, pacific islander, hispanic / ...      5
200  native american, pacific islander, hispanic / ...      5
201  native american, pacific islander, hispanic / ...      3
202           native american, pacific islander, white      7
203    native american, pacific islander, white, other      2
204                             native american, white    338
205                      native american, white, other     54
206                                              other   1706
207                                   pacific islander    432
208                 pacific islander, hispanic / latin     57
209          pacific islander, hispanic / latin, other      5
210          pacific islander, hispanic / latin, white     30
211   pacific islander, hispanic / latin, white, other      5
212                            pacific islander, other     14
213                            pacific islander, white    156
214                     pacific islander, white, other     18
215                                              white  32831
216                                       white, other    641

[217 rows x 2 columns]

In [20]:
## Height is recorded in inches.
## Although this is very close to the national
## average, let's take a look at the extremes

height = df[['height', 'sex']]
height_grouped = height.groupby('sex')
height_grouped.mean().reset_index()

  sex     height
0   f  65.103873
1   m  70.443492

In [21]:
## Here, we have a female standing at 4 inches tall.
## Also, a male at 1 inch tall.

height = df[['height', 'sex']]
height_grouped = height.groupby('sex')
height_grouped.min().reset_index()

  sex  height
0   f     4.0
1   m     1.0

In [22]:
## Here, we have a female standing at 95 inches tall.
## Also, a male at 95 inch tall.
## Just for reference, the average NBA basketball player
## stands at 79 inches tall.

height = df[['height', 'sex']]
height_grouped = height.groupby('sex')
height_grouped.max().reset_index()

  sex  height
0   f    95.0
1   m    95.0

In [23]:
## It seems that these two extremes show that
## some of the reponses for height may be wrong.
## According to US data from cdc.gov, the average height
## for female is 63.8 inches and for male is 69.3 inches

## If the data is more than 5 standard deviations away
## from the mean, I will replace it with a NaN value.

## Coincidently, the average standard deviation for
## men and women is 3.00 inches. So I am going replace
## if the users heights is over or under the US average
## by 15.00 inches with NaN values.

height_grouped.std()

       height
sex
f    2.926502
m    3.076521

In [24]:
## For income, a response of '-1' means
## perfer not to answer. I'm going to
## change it to "NaN's" so it doesn't factor
## in the average. It is also worth noting that
## there are quite a bit of millionaires using
## OkCupid. Although impressive, I'll later
## cross check these extreme values with
## other variables with extreme values.

income = df[['income', 'sex']]
income_grouped = income.groupby('income')
income_grouped = income_grouped.count().reset_index()
income_grouped.rename(index=str, columns={"sex":"count"})

     income  count
0        -1  48442
1     20000   2952
2     30000   1048
3     40000   1005
4     50000    975
5     60000    736
6     70000    707
7     80000   1111
8    100000   1621
9    150000    631
10   250000    149
11   500000     48
12  1000000    521

In [25]:
## Since jobs relate to income, it's good
## to look at those two variables together
## It seems like everything is going okay
## here. Just lots of missing values.

## From this, all the way to 'status',
## seems normal as well. With all of
## the questionable variables noted,
## it is time to do some comparions.

job = df[['job','income']]
job

                                     job  income
0                         transportation      -1
1                   hospitality / travel   80000
2                                    NaN      -1
3                                student   20000
4            artistic / musical / writer      -1
5         computer / hardware / software      -1
6                                    NaN      -1
7            artistic / musical / writer      -1
8                                    NaN      -1
9                                student      -1
10                                   NaN      -1
11     banking / financial / real estate   40000
12                 entertainment / media      -1
13           sales / marketing / biz dev   30000
14                                 other   50000
15                     medicine / health      -1
16                 entertainment / media      -1
17     banking / financial / real estate      -1
18                     medicine / health      -1
19          science / tech / engineering      -1
20           sales / marketing / biz dev      -1
21                               student      -1
22                executive / management      -1
23                  education / academia      -1
24           artistic / musical / writer      -1
25                     medicine / health      -1
26             clerical / administrative      -1
27                                 other      -1
28                                   NaN      -1
29                                 other      -1
...                                  ...     ...
59916                                NaN      -1
59917                     rather not say  100000
59918                              other      -1
59919        sales / marketing / biz dev      -1
59920       science / tech / engineering      -1
59921              entertainment / media      -1
59922                            student      -1
59923                            student      -1
59924                                NaN      -1
59925        sales / marketing / biz dev      -1
59926                                NaN      -1
59927                              other   50000
59928       science / tech / engineering      -1
59929        artistic / musical / writer      -1
59930             political / government   70000
59931       science / tech / engineering      -1
59932                              other      -1
59933                                NaN      -1
59934                              other   80000
59935                                NaN      -1
59936                              other      -1
59937               education / academia      -1
59938                                NaN      -1
59939             executive / management      -1
59940                                NaN      -1
59941        sales / marketing / biz dev      -1
59942              entertainment / media      -1
59943       construction / craftsmanship  100000
59944                  medicine / health      -1
59945                  medicine / health      -1

[59946 rows x 2 columns]